notebooks/hplc_ANOVA_notebook.org
#+TITLE: Analysis of Variance of HPLC Data

\begin{abstract}
Έχουμε πάρει πολλά δεδομένα από την HPLC για διάφορες συγκεντρώσεις σε κάθε πείραμα. Ένα καλό ερώτημα το οποίο δεν έχουμε εξετάσει είναι κατά πόσο είναι στατιστικά σημαντική η προσθήκη του μιξ γενικά ή και ξεχωριστά από το ένα επίπεδο στο άλλο. Σκοπός του αρχείου αυτού είναι να εξετάσει κάτι τέτοιο με χρήση της ANOVA.
\end{abstract}

* Dependencies
Αρχικά, όπως και στα άλλα notebooks, πρέπει να κάνουμε load κάποια dependencies τα οποία θα χρειαστούμε για αυτό το code base.

#+NAME: dependencies
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test_preprocessing.jl

  using DrWatson
  @quickactivate "Masters_Thesis"
  include(srcdir("filenames.jl"))
  using CSV, DataFrames, Statistics, Distributions

#+END_SRC

* Φόρτωση των δεδομένων
Έπειτα, πρέπει να διαβάσουμε τα CSVs με τα δεδομένα για να μπορέσουμε να κάνουμε την ανάλυση μας.

#+NAME: data_reading
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test_preprocessing.jl

  # Read all the data
  exp_35 = "10_11"
  exp_40 = "28_11"
  mix_amount = ["0", "1", "2", "4", "8"]

  # Experiment @35 C
  df35_0 = CSV.read(get_conc_csv(exp_35, mix_amount[1]), DataFrame)
  df35_1 = CSV.read(get_conc_csv(exp_35, mix_amount[2]), DataFrame)
  df35_2 = CSV.read(get_conc_csv(exp_35, mix_amount[3]), DataFrame)
  df35_4 = CSV.read(get_conc_csv(exp_35, mix_amount[4]), DataFrame)
  df35_8 = CSV.read(get_conc_csv(exp_35, mix_amount[5]), DataFrame)

  # Experiment @40 C
  df40_0 = CSV.read(get_conc_csv(exp_40, mix_amount[1]), DataFrame)
  df40_1 = CSV.read(get_conc_csv(exp_40, mix_amount[2]), DataFrame)
  df40_2 = CSV.read(get_conc_csv(exp_40, mix_amount[3]), DataFrame)
  df40_4 = CSV.read(get_conc_csv(exp_40, mix_amount[4]), DataFrame)
  df40_8 = CSV.read(get_conc_csv(exp_40, mix_amount[5]), DataFrame)

#+END_SRC

#+RESULTS: data_reading
#+begin_example
17×8 DataFrame
 Row │ Time   Sucrose    Glucose    Fructose  Lactate   Acetate   Propionate   ⋯
     │ Int64  Float64    Float64    Float64   Float64   Float64   Float64      ⋯
─────┼──────────────────────────────────────────────────────────────────────────
   1 │     0  1.35836    0.984291   2.1892    0.777989  0.515341    0.402087   ⋯
   2 │     1  1.15216    0.829136   1.80418   0.645266  0.433893    0.348323
   3 │     5  1.79113    1.18396    2.14795   0.770491  0.507007    0.431528
   4 │    24  1.51746    1.42083    2.16927   0.794013  0.566514    0.542862
   5 │    26  1.06816    0.950233   1.94116   0.761713  0.51341     0.523717   ⋯
   6 │    28  0.953606   0.0280055  1.75975   0.900778  0.596115    0.562465
   7 │    46  0.0194654  0.0208154  1.68201   1.24803   0.775296    0.687859
   8 │    48  0.0234614  0.0        1.62864   1.19914   0.751814    0.677251
  ⋮  │   ⋮        ⋮          ⋮         ⋮         ⋮         ⋮          ⋮        ⋱
  11 │    72  0.0        0.0        1.55341   0.938808  0.849385    0.742872   ⋯
  12 │    74  0.0        0.0        1.71011   1.0129    1.00473     0.831225
  13 │    94  0.0        0.0        1.72527   0.726517  1.16993     0.915695
  14 │    96  0.0        0.0        1.53916   0.616309  1.07972     0.836887
  15 │    98  0.0        0.0        1.63866   0.620383  1.15156     0.892041   ⋯
  16 │   167  0.0        0.0        0.717977  0.29702   1.43722     1.17576
  17 │   171  0.0        0.0        0.790572  0.656899  1.45461     1.23779
                                                     1 column and 2 rows omitted
#+end_example

* Επεξεργασία πρωτογενών δεδομένων
Βέβαια, δεν θέλουμε αυτούς τους πίνακες. Αρχικά θέλουμε να συγκρίνουμε τις 5 ποσότητες σε κάθε θερμοκρασία, οπότε θέλουμε τα vector των τελικών συγκεντρώσεων κάθε ένωσης.

#+NAME: data_processing
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test_preprocessing.jl

  # Take the maximum instead of defaulting for the last element as we
  # know ethanol is consumed so the last isn't the maximum which is the
  # one we are interested in.
  prod35_0 = map(maximum, eachcol(df35_0[:, 5:8]))
  prod35_1 = map(maximum, eachcol(df35_1[:, 5:8]))
  prod35_2 = map(maximum, eachcol(df35_2[:, 5:8]))
  prod35_4 = map(maximum, eachcol(df35_4[:, 5:8]))
  prod35_8 = map(maximum, eachcol(df35_8[:, 5:8]))

  prod40_0 = map(maximum, eachcol(df40_0[:, 5:8]))
  prod40_1 = map(maximum, eachcol(df40_1[:, 5:8]))
  prod40_2 = map(maximum, eachcol(df40_2[:, 5:8]))
  prod40_4 = map(maximum, eachcol(df40_4[:, 5:8]))
  prod40_8 = map(maximum, eachcol(df40_8[:, 5:8]))

  prod45_1 = map(maximum, eachcol(df45_1[:, 5:8]))
  prod45_2 = map(maximum, eachcol(df45_2[:, 5:8]))

  prod_35 = hcat(prod35_0, prod35_1, prod35_2, prod35_4, prod35_8)
  prod_40 = hcat(prod40_0, prod40_1, prod40_2, prod40_4, prod40_8)

  # Collect the 4 vectors which have the output variable in every condition
  lact_mean_35 = prod_35[1,:]
  acet_mean_35 = prod_35[2,:]
  prop_mean_35 = prod_35[3,:]
  eth_mean_35 = prod_35[4,:]

  lact_mean_40 = prod_40[1,:]
  acet_mean_40 = prod_40[2,:]
  prop_mean_40 = prod_40[3,:]
  eth_mean_40 = prod_40[4,:]

#+END_SRC

#+RESULTS: data_processing
: 5-element Vector{Float64}:
:  0.5066985805374675
:  0.4648568653625852
:  0.49108650090491535
:  0.4551414662652275
:  0.4238722874331631

* Δημιουργία ψευδο-κατανομής των δεδομένων
Για να κάνουμε ANOVA χρειάζεται κάθε μέτρηση να έχει ένα sample size μεγαλύτερο του 1 (και εφόσον κάνουμε στατιστική ανάλυση, τυπικά θέλουμε πάνω από 5 για στατιστικά σημαντικά αποτελέσματα). Δεν μπορούμε να κάνουμε το πείραμα τόσες φορές, οπότε χρειαζόμαστε έναν μηχανισμό για να φτιάξουμε δεδομένα.

Ένα claim το οποίο δεν είναι κακό είναι ότι αν κάναμε πολλές φορές το πείραμα, τα αποτελέσματα θα ακολουθούσαν κανονική κατανομή. Οπότε, με έναν μέσο όρο και μία τυπική απόκλιση, μπορούμε να φτιάξουμε δεδομένα τα οποία θα είναι περίπου σωστά και να τρέξουμε με αυτά την ANOVA. Οι μέσοι όροι θα είναι προφανώς οι τιμές που θα έχουμε παρατηρήσει. Για τις τυπικές αποκλίσεις θέλουμε κάτι άλλο. Με βάση τα στοιχεία που έχουμε, μία εύλογη εκτίμηση είναι να πούμε πως ξέρουμε ότι στην αρχή είχαμε 5 υποτίθεται ίδια δείγματα. Οπότε όποια διαφορά έχουν οφείλεται στην τυπική απόκλιση του δείγματος. Οπότε, ας υποθέσουμε ότι το variance που έχουν αυτά θα το έχουν και τα προιόντα και ας κάνουμε κατανομές αυτές τις τυπικές αποκλίσεις.

** Pre-processing
Για να πάρουμε τα δεδομένα ακολουθούμε μία παρόμοια λογική με παραπάνω και μόλις βρούμε τα διανύσματα που θέλουμε υπολογίζουμε τo standard deviation τους.

#+NAME: input_stdev
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test_preprocessing.jl

  input35_0 = Vector(df35_0[1, 5:8])
  input35_1 = Vector(df35_1[1, 5:8])
  input35_2 = Vector(df35_2[1, 5:8])
  input35_4 = Vector(df35_4[1, 5:8])
  input35_8 = Vector(df35_8[1, 5:8])

  input40_0 = Vector(df40_0[1, 5:8])
  input40_1 = Vector(df40_1[1, 5:8])
  input40_2 = Vector(df40_2[1, 5:8])
  input40_4 = Vector(df40_4[1, 5:8])
  input40_8 = Vector(df40_8[1, 5:8])

  input_35 = hcat(input35_0, input35_1, input35_2, input35_4, input35_8)
  input_40 = hcat(input40_0, input40_1, input40_2, input40_4, input40_8)

  # Collect the 4 vectors which have the input variables in every
  # condition
  lact_input_35 = input_35[1,:]
  acet_input_35 = input_35[2,:]
  prop_input_35 = input_35[3,:]
  eth_input_35 = input_35[4,:]

  lact_input_40 = input_40[1,:]
  acet_input_40 = input_40[2,:]
  prop_input_40 = input_40[3,:]
  eth_input_40 = input_40[4,:]

  # Calculate standard deviations of samples
  lact_std_35 = std(lact_input_35)
  acet_std_35 = std(acet_input_35)
  prop_std_35 = std(prop_input_35)
  eth_std_35 = std(eth_input_35)

  lact_std_40 = std(lact_input_40)
  acet_std_40 = std(acet_input_40)
  prop_std_40 = std(prop_input_40)
  eth_std_40 = std(eth_input_40)
#+END_SRC

#+RESULTS: input_stdev
: 0.014531929680207578

