notebooks/hplc_ANOVA_notebook.org
** Δημιουργία των κατανομών
Έχοντας την τυπική απόκλιση και τον μέσο όρο μπορούμε να φτιάξουμε τις κατανομές. Χάριν ευκολίας, θα φτιαχτούν vectorized κατανομές.

#+NAME: distribution_definitions
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test_preprocessing.jl

  lact_dist_35 = [Normal(lact_mean_35[i], lact_std_35) for i in 1:length(lact_mean_35)]
  acet_dist_35 = [Normal(acet_mean_35[i], acet_std_35) for i in 1:length(acet_mean_35)]
  prop_dist_35 = [Normal(prop_mean_35[i], prop_std_35) for i in 1:length(prop_mean_35)]
  eth_dist_35 = [Normal(eth_mean_35[i], eth_std_35) for i in 1:length(eth_mean_35)]

  lact_dist_40 = [Normal(lact_mean_40[i], lact_std_40) for i in 1:length(lact_mean_40)]
  acet_dist_40 = [Normal(acet_mean_40[i], acet_std_40) for i in 1:length(acet_mean_40)]
  prop_dist_40 = [Normal(prop_mean_40[i], prop_std_40) for i in 1:length(prop_mean_40)]
  eth_dist_40 = [Normal(eth_mean_40[i], eth_std_40) for i in 1:length(eth_mean_40)]

#+END_SRC

#+RESULTS: distribution_definitions
: 5-element Vector{Normal{Float64}}:
:  Normal{Float64}(μ=0.5066985805374675, σ=0.014531929680207578)
:  Normal{Float64}(μ=0.4648568653625852, σ=0.014531929680207578)
:  Normal{Float64}(μ=0.49108650090491535, σ=0.014531929680207578)
:  Normal{Float64}(μ=0.4551414662652275, σ=0.014531929680207578)
:  Normal{Float64}(μ=0.4238722874331631, σ=0.014531929680207578)

** Sampling
Έχοντας τις κατανομές, μπορούμε να κάνουμε sample έναν αριθμό από δείγματα για να τρέξουμε την ANOVA. Εφόσον έχουμε την δυνατότητα να πάρουμε όσα samples θέλουμε, μπορούμε να βάλουμε και μεγάλα νούμερα, αλλά για παράδειγμα 20 δείγματα είναι μάλλον ένα καλό νούμερο.

#+NAME: sampling
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test_preprocessing.jl

  samples = 20
  lact_samples_35 = [rand(lact_dist_35[i], samples) for i in 1:length(lact_mean_35)]
  acet_samples_35 = [rand(acet_dist_35[i], samples) for i in 1:length(acet_mean_35)]
  prop_samples_35 = [rand(prop_dist_35[i], samples) for i in 1:length(prop_mean_35)]
  eth_samples_35 = [rand(eth_dist_35[i], samples) for i in 1:length(eth_mean_35)]

  lact_samples_40 = [rand(lact_dist_40[i], samples) for i in 1:length(lact_mean_40)]
  acet_samples_40 = [rand(acet_dist_40[i], samples) for i in 1:length(acet_mean_40)]
  prop_samples_40 = [rand(prop_dist_40[i], samples) for i in 1:length(prop_mean_40)]
  eth_samples_40 = [rand(eth_dist_40[i], samples) for i in 1:length(eth_mean_40)]

#+END_SRC

#+RESULTS: sampling
: 5-element Vector{Vector{Float64}}:
:  [0.49868747265866653, 0.4869343197770326, 0.5157334778753895, 0.5128735756232315, 0.5005028155075176, 0.48958906441704886, 0.4801573347399146, 0.4991816035400777, 0.5032963210721053, 0.5137558608107206, 0.5007474394505066, 0.5148199738497963, 0.4950327163879213, 0.4798104208580435, 0.522120555780145, 0.5158938901875638, 0.516183700840565, 0.4830689229379774, 0.5042507185938094, 0.5130668453562083]
:  [0.4650713867242923, 0.4963371658594932, 0.46075453194872, 0.4818074021646951, 0.4661132434692044, 0.45849112459014957, 0.45478618377326574, 0.4702445472055113, 0.462597102304449, 0.4884472368297681, 0.4679448363556905, 0.46924284570524216, 0.48007196454724466, 0.46938794930539607, 0.49045188035596304, 0.48730022498014375, 0.49593691902479903, 0.45190810190304315, 0.4643560021120398, 0.4954741709345398]
:  [0.5016269247272017, 0.48543179769256234, 0.49364536451733415, 0.47652074640160896, 0.48531253424716364, 0.5197766658623957, 0.4988860879097682, 0.47874263209632795, 0.5254412601034922, 0.5010896983555859, 0.48933990966784424, 0.4920837617288359, 0.505075214635014, 0.4971993104534569, 0.4945317527854313, 0.4838746009410711, 0.49564705047249874, 0.5041972118207785, 0.4787651122907324, 0.5008921618945169]
:  [0.4608312264715753, 0.4590227691142619, 0.4298668627217868, 0.41512159809453886, 0.45581456680596416, 0.45347752484849463, 0.45444696945230517, 0.4307105190804349, 0.44587981606257804, 0.4710798832121142, 0.4779481999256904, 0.45689049802853526, 0.4605879618359982, 0.4366698156107729, 0.4517025808808985, 0.44332846734203823, 0.4676100109514397, 0.4848796676030306, 0.4654749919645743, 0.46994019159722916]
:  [0.42102166874648345, 0.42036784799169524, 0.40101808946323414, 0.39943135128707286, 0.39741508054682617, 0.4212458946586835, 0.41255466724727513, 0.41065082835178546, 0.4101203173345793, 0.4229427439792658, 0.4256893063651016, 0.4233047523426158, 0.43104935853442333, 0.4097915557501248, 0.43204113755448686, 0.43013008037753947, 0.4062311713612946, 0.4477049709648432, 0.4266369221785621, 0.4090072513204785]

* ANOVA
Έχοντας κάνει sample έχουμε τώρα κάποια διανύσματα όπου τα καθένα έχει 20 παρατηρήσεις και μπορεί να γίνει μία ANOVA για να δείξει σε ποιά από τα 8 συστήματα (4 προιόντα, 2 θερμοκρασίες) έπαιξε όντως ρόλο η προσθήκη του μιξ και σε ποιά δεν φαίνεται να έπαιξε. Αρχικά, γράφουμε ένα function που κάνει implement την ANOVA.

#+NAME: anova
#+BEGIN_SRC julia :noweb no-export :tangle ../scripts/hypothesis_test.jl

  <<dependencies>>
  include(scriptsdir("hypothesis_test_preprocessing.jl"))

  function manualANOVA(allData)
      nArray = length.(allData)
      d = length(nArray)

      xBarTotal = mean(vcat(allData...))
      xBarArray = mean.(allData)

      ssBetween = sum( [nArray[i]*(xBarArray[i] - xBarTotal)^2 for i in 1:d] )
      ssWithin = sum([sum([(ob - xBarArray[i])^2 for ob in allData[i]])
				  for i in 1:d])
      dfBetween = d-1
      dfError = sum(nArray)-d

      msBetween = ssBetween/dfBetween
      msError = ssWithin/dfError
      fStat = msBetween/msError
      pval = ccdf(FDist(dfBetween,dfError),fStat)
      return fStat, pval
  end

#+END_SRC

#+RESULTS: anova
: manualANOVA (generic function with 1 method)

και έπειτα το εφαρμόζουμε στα 8 διανύσματα που παράξαμε πριν. Το output θα είναι η τιμή του f-statistic καθώς και το p-value. Τυπικά σε μία ANOVA, αν το f-statistic είναι κοντά στο 1 δεν μπορούμε να απορρίψουμε την υπόθεση H_0 η οποία λέει πως δεν έπαιξε ρόλο η προσθήκη του mix αλλά έγινε τυχαία. Το p-value μας λέει με τι βεβαιότητα απορρίπτουμε ή όχι την υπόθεση.

#+NAME: anova_results
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test.jl

  lact_anova_35 = manualANOVA(lact_samples_35)
  acet_anova_35 = manualANOVA(acet_samples_35)
  prop_anova_35 = manualANOVA(prop_samples_35)
  eth_anova_35 = manualANOVA(eth_samples_35)

  lact_anova_40 = manualANOVA(lact_samples_40)
  acet_anova_40 = manualANOVA(acet_samples_40)
  prop_anova_40 = manualANOVA(prop_samples_40)
  eth_anova_40 = manualANOVA(eth_samples_40)

  anova_35 = reshape([lact_anova_35..., acet_anova_35..., prop_anova_35..., eth_anova_35...], 2, 4)
  anova_40 = reshape([lact_anova_40..., acet_anova_40..., prop_anova_40..., eth_anova_40...], 2, 4)

#+END_SRC

#+RESULTS: anova_results
: 2×4 Matrix{Float64}:
:  483.049        8.13106     30.4874       115.817
:    3.38583e-62  1.10655e-5   2.55448e-16    1.18415e-35

Από τα αποτελέσματα αυτά, είναι εμφανές πως η ποσότητα του mix που προστίθεται είναι σίγουρα σημαντική επειδή όλα τα p-values είναι πάρα πολύ χαμηλά.

Μπορούμε επίσης να τα αποθηκεύσουμε σε έναν ωραίο πίνακα:

#+NAME: anova_tables
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test.jl

  names = ["Lactate_35", "Acetate_35", "Propionate_35", "Ethanol_35", "Lactate_40", "Acetate_40", "Propionate_40", "Ethanol_40"]
  anova_data = hcat(anova_35, anova_40)

  anova_table = Tables.table(hcat(names, anova_data'), header = [:Test, :FStatistic, :pValue])
  CSV.write(datadir("exp_pro", "anova_35_40.csv"), anova_table)
  DataFrame(anova_table)

#+END_SRC

#+RESULTS: anova_tables
#+begin_example
8×3 DataFrame
 Row │ Test           FStatistic  pValue      
     │ Any            Any         Any         
─────┼────────────────────────────────────────
   1 │ Lactate_35     271.031     4.92964e-51
   2 │ Acetate_35     317.189     4.97686e-54
   3 │ Propionate_35  105.405     4.63088e-34
   4 │ Ethanol_35     172.554     1.15034e-42
   5 │ Lactate_40     483.049     3.38583e-62
   6 │ Acetate_40     8.13106     1.10655e-5
   7 │ Propionate_40  30.4874     2.55448e-16
   8 │ Ethanol_40     115.817     1.18415e-35
#+end_example

* Άλλα hypothesis tests
