notebooks/hplc_ANOVA_notebook.org
** ANOVA σε 2 mL και πάνω
Από τα διαγράμματα που είχαμε κάνει, είχε παρατηρηθεί πως ενδέχεται να μην έχει νόημα να βάλουμε πάνω από 2 ml του mix. Στους 35, η συμπεριφορά που παρατηρήθηκε ήταν καθαρά αρνητική ενώ στους 40 σε πολλά φάνηκε να είναι περίπου αμελητέα αν όχι αρνητική. Οπότε, έχει νόημα να κάνουμε anova και εδώ για να δούμε τι βγάζει.

#+NAME: ANOVA_2_plus
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test.jl

  lact_anova_35_2plus = manualANOVA(lact_samples_35[3:5])
  acet_anova_35_2plus = manualANOVA(acet_samples_35[3:5])
  prop_anova_35_2plus = manualANOVA(prop_samples_35[3:5])
  eth_anova_35_2plus = manualANOVA(eth_samples_35[3:5])

  lact_anova_40_2plus = manualANOVA(lact_samples_40[3:5])
  acet_anova_40_2plus = manualANOVA(acet_samples_40[3:5])
  prop_anova_40_2plus = manualANOVA(prop_samples_40[3:5])
  eth_anova_40_2plus = manualANOVA(eth_samples_40[3:5])

  anova_35_2plus = reshape([lact_anova_35_2plus..., acet_anova_35_2plus..., prop_anova_35_2plus..., eth_anova_35_2plus...], 2, 4)
  anova_40_2plus = reshape([lact_anova_40_2plus..., acet_anova_40_2plus..., prop_anova_40_2plus..., eth_anova_40_2plus...], 2, 4)

  anova_data_2plus = hcat(anova_35_2plus, anova_40_2plus)

  anova_table_2plus = Tables.table(hcat(names, anova_data_2plus'), header = [:Test, :FStatistic, :pValue])
  CSV.write(datadir("exp_pro", "anova_35_40_2plus.csv"), anova_table_2plus)
  DataFrame(anova_table_2plus)

#+END_SRC

#+RESULTS: ANOVA_2_plus
#+begin_example
8×3 DataFrame
 Row │ Test           FStatistic  pValue      
     │ Any            Any         Any         
─────┼────────────────────────────────────────
   1 │ Lactate_35     252.209     4.87277e-29
   2 │ Acetate_35     47.1273     8.33169e-13
   3 │ Propionate_35  62.9024     3.76521e-15
   4 │ Ethanol_35     255.16      3.61682e-29
   5 │ Lactate_40     390.101     5.51787e-34
   6 │ Acetate_40     5.21984     0.00828594
   7 │ Propionate_40  4.37956     0.0170094
   8 │ Ethanol_40     145.021     4.38079e-23
#+end_example

#+RESULTS:
: 2×4 Matrix{Float64}:
:  390.101        5.21984     4.37956    145.021
:    5.51787e-34  0.00828594  0.0170094    4.38079e-23

Προκύπτει πως στους 35 όλες οι μεταβολές είναι στατιστικά σημαντικές και είναι όλες μειώσεις. Οπότε σίγουρα δεν θέλουμε πάνω από 2 ml. Στους 40, η αιθανόλη μειώνεται με στατιστικά σημαντικό τρόπο ενώ το γαλακτικό αυξάνεται. Το οξικό και το προπιονικό και αυτά αυξάνονται με στατιστικά σημαντικό τρόπο, αλλά έχουν πολύ μεγαλύτερα p-values. Συγκεκριμένα το οξικό μπορούμε να απορρίψουμε την H_0 με confidence interval 99% αλλά οριακά και στο προπιονικό μπορούμε με interval 95%. Οπότε στους 40 υπάρχει επαρκής evidence για να πάμε σε πάνω από 2 ml.

** T-test για 4-8 ml στους 40
Εφόσον στους 40 υπάρχει evidence για να πάμε πάνω από 2 ml, αξίζει να δούμε και αν υπάρχει evidence για να πάμε στα 8 ml ή αν δεν είναι στατιστικά σημαντικό σε σχέση με το 4.

#+NAME: ttest_40
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test.jl

  lact_ttest_40 = EqualVarianceTTest(lact_samples_40[4], lact_samples_40[5])
  acet_ttest_40 = EqualVarianceTTest(acet_samples_40[4], acet_samples_40[5])
  prop_ttest_40 = EqualVarianceTTest(prop_samples_40[4], prop_samples_40[5])
  eth_ttest_40 = EqualVarianceTTest(eth_samples_40[4], eth_samples_40[5])

  ttest_40_res = [pvalue(lact_ttest_40), pvalue(acet_ttest_40), pvalue(prop_ttest_40), pvalue(eth_ttest_40)]
#+END_SRC

#+RESULTS: ttest_40
: 4-element Vector{Float64}:
:  2.22371806920641e-22
:  0.8601425484051867
:  0.05330746828235466
:  3.349408697247747e-9

Τα αποτελέσματα του test αυτού δείχνουν πως η αλλαγή του οξικού και του προπιονικού δεν είναι στατιστικά σημαντική (το οξικό με μεγάλη βεβαιότητα, το προπιονικό οριακά δεν μπορεί να απορριφθεί στο 95%) ενώ η αιθανόλη μειώνεται με στατιστικά σημαντικό τρόπο. Οπότε, αν σκεφτούμε το αυξημένο κόστος της προσθήκης μεγαλύτερης ποσότητας, αφού επηρεάζεται μόνο το γαλακτικό, δεν είναι στατιστικά σημαντική η προσθήκη 8 ml σε αντίθεση με τα 4.

** ANOVA σε 2 ml και κάτω στους 35
Εφόσον στους 35 δεν έχει νόημα να πάμε πάνω από 2, αξίζει να εξεταστεί αν έχει νόημα και το 2 ή μήπως ούτε αυτό χρειάζεται και θα λειτουργούσε το ίδιο και χωρίς ένζυμα.

#+NAME: ANOVA_2_minus
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test.jl

  lact_anova_35_2minus = manualANOVA(lact_samples_35[1:3])
  acet_anova_35_2minus = manualANOVA(acet_samples_35[1:3])
  prop_anova_35_2minus = manualANOVA(prop_samples_35[1:3])
  eth_anova_35_2minus = manualANOVA(eth_samples_35[1:3])

  anova_35_2minus = reshape([lact_anova_35_2minus..., acet_anova_35_2minus..., prop_anova_35_2minus..., eth_anova_35_2minus...], 2, 4)

  new_names = ["Lactate", "Acetate", "Propionate", "Ethanol"]
  anova_table_2minus = Tables.table(hcat(new_names, anova_35_2minus'), header = [:Test, :FStatistic, :pValue])
  CSV.write(datadir("exp_pro", "anova_35_2minus.csv"), anova_table_2minus)
  DataFrame(anova_table_2minus)
#+END_SRC

#+RESULTS: ANOVA_2_minus
: 4×3 DataFrame
:  Row │ Test        FStatistic  pValue      
:      │ Any         Any         Any         
: ─────┼─────────────────────────────────────
:    1 │ Lactate     484.413     1.68593e-36
:    2 │ Acetate     212.78      3.64088e-27
:    3 │ Propionate  34.4211     1.57541e-10
:    4 │ Ethanol     301.943     4.66462e-31

Προκύπτει με πολύ μεγάλη βεβαιότητα ότι οι μεταβολές που υπάρχουν μεταξύ αυτών των 3 είναι στατιστικά σημαντικές. Βέβαια, το οξικό και το προπιονικό μειώνονται με στατιστικά σημαντικό τρόπο, δεν αυξάνονται.

** Επίδραση της θερμοκρασίας
Εκτός από τα παραπάνω που έδειξαν ότι οι διαφορετικές παίζουν ρόλο και ανάλογα με το τι θέλουμε επιλέγουμε ποια θα πάρουμε, έχει νόημα να εξετάσουμε και αν είναι στατιστικά σημαντική η επίδραση της θερμοκρασίας. Για αυτό, πρέπει να κάνουμε t-test μεταξύ ίδιων ποσοτήτων στις 2 θερμοκρασίες. Ο κώδικας για αυτό είναι παρακάτω.

#+NAME: temperature_ttest
#+BEGIN_SRC julia :tangle ../scripts/hypothesis_test.jl

  # Run the hypothesis tests
  lact_temp_ttest = [UnequalVarianceTTest(lact_samples_35[i], lact_samples_40[i]) for i in 1:length(lact_samples_35)]
  acet_temp_ttest = [UnequalVarianceTTest(acet_samples_35[i], acet_samples_40[i]) for i in 1:length(acet_samples_35)]
  prop_temp_ttest = [UnequalVarianceTTest(prop_samples_35[i], prop_samples_40[i]) for i in 1:length(prop_samples_35)]
  eth_temp_ttest = [UnequalVarianceTTest(eth_samples_35[i], eth_samples_40[i]) for i in 1:length(eth_samples_35)]

  # Get the pvalues of each test
  lact_temp_pvalues = pvalue.(lact_temp_ttest)
  acet_temp_pvalues = pvalue.(acet_temp_ttest)
  prop_temp_pvalues = pvalue.(prop_temp_ttest)
  eth_temp_pvalues = pvalue.(eth_temp_ttest)

  # Format them in a nice table and write it to CSV
  temp_ttest_table = Tables.table(hcat(mix_amount, lact_temp_pvalues, acet_temp_pvalues, prop_temp_pvalues, eth_temp_pvalues), header = [:Mix_Amount, :Lactate, :Acetate, :Propionate, :Ethanol])
  CSV.write(datadir("exp_pro", "temp_ttest.csv"), temp_ttest_table)
  DataFrame(temp_ttest_table)
#+END_SRC

#+RESULTS: temperature_ttest
: 5×5 DataFrame
:  Row │ Mix_Amount  Lactate      Acetate      Propionate   Ethanol     
:      │ Any         Any          Any          Any          Any         
: ─────┼────────────────────────────────────────────────────────────────
:    1 │ 0           2.64221e-9   0.00963913   3.67514e-6   3.93492e-20
:    2 │ 1           3.34504e-11  0.0420889    9.52229e-9   7.68513e-30
:    3 │ 2           8.67235e-13  8.92097e-15  0.0366243    1.30894e-29
:    4 │ 4           8.65549e-19  3.93894e-21  2.05434e-17  5.7464e-29
:    5 │ 8           1.46139e-22  4.55379e-20  2.78744e-13  2.11086e-25

Από τα αποτελέσματα, είναι εμφανές πως η θερμοκρασία παίζει ρόλο παντού. Αξίζει να σημειωθεί πως σε 2 τιμές του οξικού και μία του προπιονικού, ο ρόλος της θερμοκρασίας δεν είναι σίγουρος, αλλά με 95% βεβαιότητα μπορούμε να απορρίψουμε την υπόθεση ότι δεν παίζει ρόλο παντού.

