notebooks/hplc_ANOVA_notebook.tex

\section{Τελικά Συμπεράσματα}
\label{sec:org34c21da}
Στο αρχείο αυτό έγιναν διάφορα hypothesis tests με σκοπό να δούμε αν οι παραμέτροι που ελέγχουμε έχουν στατιστικά σημαντική επίδραση στην τελική συγκέντρωση των προιόντων. Σε γενικές γραμμές, οι περισσότερες παραμέτροι έχουν σημαντική επίδραση. Σε κάποιες περιπτώσεις όμως, αυτό το συμπέρασμα δεν μπορεί να βγεί με τόση βεβαιότητα ή δεν μπορεί να βγεί καθόλου.

Τα τεστ που έγιναν είναι τα εξής: ANOVA μεταξύ των 5 διαφορετικών ποσοτήτων mix στις 2 δύο θερμοκρασίες και στα 4 προιόντα. ANOVA μεταξύ των ποσοτήτων 2, 4 και 8 ml και στις 2 θερμοκρασίες για να δούμε αν πραγματικά επιφέρει κάτι η προσθήκη πάνω από 2 ml. t-test μεταξύ 4 και 8 ml στους 40 (όπου είχε νόημα να αυξήσουμε πάνω από 2 ml με βάση το προηγούμενο). ANOVA μεταξύ 0, 1 και 2 ml στους 35 για να δούμε αν έχουν νόημα τα 2 ml επειδή τα παραπάνω σίγουρα δεν έχουν. t-test συγκρίνοντας τις 2 θερμοκρασίες για κάθε mix\textsubscript{amount} και ένωση.

Καθώς οι περισσότερες υποθέσεις απορρίφθηκαν με μεγάλη βεβαιότητα (μεγαλύτερη από 99.99\%), παρακάτω θα σημειωθούν όσες απορρίφθηκαν με λιγότερη ή δεν μπόρεσαν να απορριφθούν.

\subsection{Απόρριψη με 99\% βεβαιότητα}
\label{sec:org8f47f90}
Το οξικό στους 40 για ποσότητες 2-8 ml.
Το t-test για την θερμοκρασία στα 0 ml οξικού.

\subsection{Απόρριψη με 95\% βεβαιότητα}
\label{sec:orgc6e53b8}
Το προπιονικό στους 40 για ποσότητες 2-8 ml.
Το t-test για την θερμοκρασία στο 1 ml οξικό και στα 2 ml προπιονικό.

\subsection{Δεν μπόρεσαν να απορριφθούν}
\label{sec:orgd6cff9f}
Το t-test για το οξικό και το προπιονικό στους 40 μεταξύ 4 και 8 ml.
\end{document}